{
  "nbformat": 4,
  "nbformat_minor": 0,
  "metadata": {
    "colab": {
      "provenance": []
    },
    "kernelspec": {
      "name": "python3",
      "display_name": "Python 3"
    },
    "language_info": {
      "name": "python"
    }
  },
  "cells": [
    {
      "cell_type": "code",
      "execution_count": 1,
      "metadata": {
        "id": "D1kS_CDFGMHB",
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "outputId": "80fb6e59-2aec-4b90-f3b0-3e986b66d557"
      },
      "outputs": [
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "Collecting rdflib\n",
            "  Downloading rdflib-7.0.0-py3-none-any.whl (531 kB)\n",
            "\u001b[2K     \u001b[90m━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━\u001b[0m \u001b[32m531.9/531.9 kB\u001b[0m \u001b[31m7.6 MB/s\u001b[0m eta \u001b[36m0:00:00\u001b[0m\n",
            "\u001b[?25hCollecting isodate<0.7.0,>=0.6.0 (from rdflib)\n",
            "  Downloading isodate-0.6.1-py2.py3-none-any.whl (41 kB)\n",
            "\u001b[2K     \u001b[90m━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━\u001b[0m \u001b[32m41.7/41.7 kB\u001b[0m \u001b[31m6.6 MB/s\u001b[0m eta \u001b[36m0:00:00\u001b[0m\n",
            "\u001b[?25hRequirement already satisfied: pyparsing<4,>=2.1.0 in /usr/local/lib/python3.10/dist-packages (from rdflib) (3.1.1)\n",
            "Requirement already satisfied: six in /usr/local/lib/python3.10/dist-packages (from isodate<0.7.0,>=0.6.0->rdflib) (1.16.0)\n",
            "Installing collected packages: isodate, rdflib\n",
            "Successfully installed isodate-0.6.1 rdflib-7.0.0\n"
          ]
        }
      ],
      "source": [
        "!pip install rdflib"
      ]
    },
    {
      "cell_type": "code",
      "source": [
        "from rdflib import Graph, URIRef\n",
        "from rdflib.namespace import RDFS, SKOS"
      ],
      "metadata": {
        "id": "9vc0bfgf5dmg"
      },
      "execution_count": 2,
      "outputs": []
    },
    {
      "cell_type": "code",
      "source": [
        "g = Graph()\n",
        "g.parse('https://www.wikidata.org/wiki/Special:EntityData/Q2831.ttl')"
      ],
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "nEK26Fd15djj",
        "outputId": "28c954ac-ff20-4c61-e2ea-fff150b2fa56"
      },
      "execution_count": 3,
      "outputs": [
        {
          "output_type": "execute_result",
          "data": {
            "text/plain": [
              "<Graph identifier=N937617e954fd4e9297856f6ce869e425 (<class 'rdflib.graph.Graph'>)>"
            ]
          },
          "metadata": {},
          "execution_count": 3
        }
      ]
    },
    {
      "cell_type": "code",
      "source": [
        "len(g)"
      ],
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "VYndY4jH5dgq",
        "outputId": "a9995fcd-edf6-451b-fa5f-fa13b2a5f700"
      },
      "execution_count": 4,
      "outputs": [
        {
          "output_type": "execute_result",
          "data": {
            "text/plain": [
              "25272"
            ]
          },
          "metadata": {},
          "execution_count": 4
        }
      ]
    },
    {
      "cell_type": "markdown",
      "source": [
        "Printing labels"
      ],
      "metadata": {
        "id": "mKgPFVTEDjcr"
      }
    },
    {
      "cell_type": "code",
      "source": [
        "mJ = URIRef('http://www.wikidata.org/entity/Q2831')\n",
        "for lab in g.objects(mJ,SKOS.altLabel):\n",
        "    print(lab.value, lab.language)"
      ],
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "yNVRZkpx5ddw",
        "outputId": "a11457a8-efe6-48d4-ff73-991640889e40"
      },
      "execution_count": 8,
      "outputs": [
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "Michael Joseph Jackson de\n",
            "MJ de\n",
            "Jacko de\n",
            "M.J. de\n",
            "M. J. de\n",
            "King of Pop de\n",
            "The King of Pop de\n",
            "Re del Pop it\n",
            "Michael Joseph Jackson it\n",
            "Jacko it\n",
            "Michael Joe Jackson it\n",
            "Michael J. Jackson it\n",
            "MJ en\n",
            "The King of Pop en\n",
            "Michael Joe Jackson en\n",
            "Michael Joseph Jackson en\n",
            "M.J. en\n",
            "M. J. en\n",
            "King of Pop en\n",
            "King of Music en\n",
            "Król Popu pl\n",
            "Michael Joseph Jackson pl\n",
            "Джексон, Майкл ru\n",
            "MJ ru\n",
            "The King of Pop ru\n",
            "Майкл Джозеф Джексон ru\n",
            "Король поп-музыки ru\n",
            "Майкл Джо Джексон ru\n",
            "Michael Joseph Jackson nl\n",
            "The King of Pop nl\n",
            "迈克尔杰克逊 zh\n",
            "麥可·傑克森 zh\n",
            "米高·積遜 zh\n",
            "米高積遜 zh\n",
            "杰克逊，M. zh\n",
            "MJ gl\n",
            "King Of Pop gl\n",
            "The King gl\n",
            "Michael Joseph Jackson gl\n",
            "MJ es\n",
            "Michael Joe Jackson es\n",
            "Michael Joseph Jackson es\n",
            "Rey del Pop es\n",
            "Rey de la Música es\n",
            "El Rey es\n",
            "El rey del pop es\n",
            "米高·積遜 zh-hk\n",
            "邁克爾傑克遜 zh-hant\n",
            "Regele muzicii pop ro\n",
            "Regele pop-ului ro\n",
            "Michael Joseph Jackson ro\n",
            "A pop királya hu\n",
            "Jacko hu\n",
            "Michael Joseph Jackson hu\n",
            "MJ hu\n",
            "Michael Joseph Jackson ca\n",
            "MJ ca\n",
            "King Of Pop ca\n",
            "King of Music ca\n",
            "The King ca\n",
            "The King of Pop lb\n",
            "Michael Joseph Jackson lb\n",
            "MJ lb\n",
            "പോപ് രാജാവ് ml\n",
            "കിംങ്ങ് ഓഫ് പോപ് ml\n",
            "എം.ജെ ml\n",
            "മൈക്കൽ ജോ ജാക്സൺ ml\n",
            "Miĥaelo Jozefo Jackson eo\n",
            "Roi de la Pop fr\n",
            "Michael Joseph Jackson fr\n",
            "MJ fr\n",
            "MJJ fr\n",
            "roue pop br\n",
            "Michael Joseph Jackson br\n",
            "MJ ja\n",
            "キング・オブ・ポップ ja\n",
            "The King of Pop frc\n",
            "Michael Joseph Jackson frc\n",
            "MJ tr\n",
            "Michael Joseph Jackson tr\n",
            "Džekson Maikl vep\n",
            "Maikl Džozef Džekson vep\n",
            "Džekson Maikl Džozef vep\n",
            "ملك البوب ar\n",
            "مايكل جوزيف جاكسون ar\n",
            "Ем-Џеј sr\n",
            "MJ sr\n",
            "Краљ попа sr\n",
            "Мајкл Џо Џексон sr\n",
            "Мајкл Џозеф Џексон sr\n",
            "Michael Joseph Jackson nb\n",
            "Michael Joe Jackson nb\n",
            "00002961801 IPI nb\n",
            "Michael Joseph Jackson nn\n",
            "MJ ms\n",
            "Raja Pop ms\n",
            "Michael Joe Jackson ms\n",
            "Michael Joseph Jackson ms\n",
            "ማይክል ጆሴፍ ጃክሰን am\n",
            "Michaël Iosephus Jackson la\n",
            "Michaël Jackson la\n",
            "Michael Iosephus Jackson la\n",
            "مايكول جېكسون ug\n",
            "Michael Joseph Jackson se\n",
            "Michael Joe Jackson se\n",
            "Michael Joseph Jackson et\n",
            "Michael Joe Jackson et\n",
            "Michael Joseph Jackson fi\n",
            "Michael Joseph Jackson fit\n",
            "Michael Joe Jackson fit\n",
            "Майкл Джозеф Джексон mhr\n",
            "Майкл Джексон mhr\n",
            "Майкл Джо Джексон mhr\n",
            "Michael Joseph Jackson rmf\n",
            "Michael Joe Jackson rmf\n",
            "Майкл Джозеф Джексон sjd\n",
            "Майкл Джо Джексон sjd\n",
            "Michael Joseph Jackson sje\n",
            "Michael Joe Jackson sje\n",
            "Michael Joseph Jackson sju\n",
            "Michael Joe Jackson sju\n",
            "Michael Joseph Jackson sma\n",
            "Michael Joe Jackson sma\n",
            "Michael Joseph Jackson smj\n",
            "Michael Joe Jackson smj\n",
            "Michael Joseph Jackson smn\n",
            "Michael Joe Jackson smn\n",
            "Michael Joseph Jackson sms\n",
            "Michael Joe Jackson sms\n",
            "Michael Joseph Jackson sv\n",
            "Michael Joe Jackson sv\n",
            "ام‌جی fa\n",
            "سلطان پاپ fa\n",
            "پادشاه پاپ fa\n",
            "ام.جی. fa\n",
            "مایکل جوزف جکسون fa\n",
            "Michael Joseph Jackson co\n",
            "MJJ co\n",
            "ᎹᏱᎩᎵ ᏦᏎᏫ ᏤᎩᏌᏂ chr\n",
            "King of Pop gcr\n",
            "MJ gcr\n",
            "Michael Joseph Jackson gcr\n",
            "The King of Pop gcr\n",
            "The King gcr\n",
            "M.J. gcr\n",
            "Michael Jackson ab\n",
            "MJ ab\n",
            "Michael Joseph Jackson ab\n",
            "M.J. ab\n",
            "King of Pop ab\n",
            "The King of Pop ab\n",
            "King of Pop ban\n",
            "The King of Pop ban\n",
            "Michael Joseph Jackson ban\n",
            "MJ ban\n",
            "M.J. ban\n",
            "Michael Joe Jackson pt\n",
            "Michael Joseph Jackson pt\n",
            "MJ pt\n",
            "Rei do Pop pt\n",
            "MJ da\n",
            "M.J. da\n",
            "M. J. da\n",
            "Michael Joseph Jackson da\n",
            "Michael Joe Jackson da\n",
            "The King of Pop da\n",
            "King of Pop da\n",
            "King of Pop ss\n",
            "The King of Pop ss\n",
            "Michael Jackson az\n",
            "Michael Jackson crh\n",
            "Maykl Cozef Cekson crh\n",
            "Maikel Jakthon din\n",
            "Michael Jackson jbo\n",
            "ಮೈಕಲ್ ಜ್ಯಾಕ್ಸನ್ kn\n",
            "Maikls Džeksons ltg\n",
            "Michael Jackson lv\n",
            "မိုက်ကယ် ဂျက်ဆင် my\n",
            "Michael Jackson om\n",
            "Maekl Jeksun pih\n",
            "Майкл Джексон udm\n",
            "迈克尔·杰克逊 wuu\n",
            "UMichael Jackson xh\n",
            "Michael Jackson xh\n",
            "Michael Jackson sgs\n",
            "Michael Jackson vro\n",
            "Michael Joe Jackson ast\n",
            "Michael Jackson iu\n",
            "Мајкл Џозеф Џексон sr-ec\n",
            "MJ ig\n",
            "The King of Pop ig\n",
            "The King ig\n",
            "King of Pop ig\n",
            "King of Music ig\n",
            "Michael Joseph Jackson ig\n",
            "Eze Pop ig\n",
            "Rei do Pop pt-br\n",
            "Michael Joe Jackson pt-br\n",
            "Michael Joseph Jackson pt-br\n",
            "MJ pt-br\n",
            "Michael Joe Jackson bar\n",
            "Michael Joseph Jackson fy\n",
            "Michael Joe Jackson ku\n",
            "Michael Joseph Jackson sk\n",
            "Michael Joseph Jackson vi\n",
            "Michael Joseph Jackson bs\n",
            "Michael Joseph Jackson fo\n",
            "Michael Joe Jackson jv\n",
            "Michael Joseph Jackson nds\n",
            "Michael Joseph Jackson cs\n",
            "Michael Joseph Jackson id\n",
            "MJ id\n",
            "The King of Pop id\n",
            "Michael Joe Jackson id\n",
            "M.J. id\n",
            "M. J. id\n",
            "King of Pop id\n",
            "King of Music id\n",
            "The King id\n",
            "The King of Pop avk\n",
            "Michael Joseph Jackson avk\n",
            "King of Pop avk\n",
            "King of Music avk\n",
            "The King avk\n",
            "MJ avk\n",
            "Michael Jackson ady\n",
            "The King of Pop ady\n",
            "MJ ady\n",
            "The King ady\n",
            "King of Pop ady\n",
            "King of Music ady\n",
            "Michael Jackson arc\n",
            "The King of Pop arc\n",
            "MJ arc\n",
            "Michael Jackson av\n",
            "The King of Pop av\n",
            "MJ av\n",
            "Джексон, Майкл av\n",
            "Michael Joseph Jackson af\n",
            "Michael Joseph Jackson yo\n",
            "MJ yo\n",
            "The King of Pop yo\n",
            "The King yo\n",
            "The King of Music yo\n",
            "King of Pop yo\n",
            "Ọba Pop yo\n",
            "The King of Pop bm\n",
            "Michael Joseph Jackson bm\n",
            "MJ bm\n",
            "The King bm\n",
            "King of Pop bm\n",
            "King of Music bm\n",
            "M.J. bm\n",
            "𐌼𐌹𐌺𐌰𐌴𐌻 𐌹𐌰𐌿𐍃𐌰𐌹𐍆 𐌳𐌹𐌰𐌹𐌺𐍃𐌰𐌿𐌽 got\n",
            "Michael Jackson uk\n",
            "Король поп-музики uk\n",
            "Michael Joseph Jackson en-us\n",
            "The King of Pop gur\n",
            "MJ gur\n",
            "King of Music gur\n",
            "Michael Joseph Jackson gur\n",
            "Michael Joseph Jackson sco\n",
            "Michael Joe Jackson sco\n",
            "Keeng o Pop sco\n",
            "Майкл Жозеф Жексон lez\n",
            "Майкл Жозеф Жэксон mn\n",
            "Michael Joseph Jackson dsb\n"
          ]
        }
      ]
    },
    {
      "cell_type": "code",
      "source": [
        "qres = g.query( '''\n",
        "    SELECT ?label\n",
        "    WHERE {\n",
        "      wd:Q2831 skos:altLabel ?label .\n",
        "    }\n",
        "''')\n",
        "for lab, *_ in qres:\n",
        "  print(lab.value, lab.language)"
      ],
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "dYaE5HTd5dXc",
        "outputId": "78d3b029-c7c6-47ae-aa61-63c64769512c"
      },
      "execution_count": 13,
      "outputs": [
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "Michael Joseph Jackson de\n",
            "MJ de\n",
            "Jacko de\n",
            "M.J. de\n",
            "M. J. de\n",
            "King of Pop de\n",
            "The King of Pop de\n",
            "Re del Pop it\n",
            "Michael Joseph Jackson it\n",
            "Jacko it\n",
            "Michael Joe Jackson it\n",
            "Michael J. Jackson it\n",
            "MJ en\n",
            "The King of Pop en\n",
            "Michael Joe Jackson en\n",
            "Michael Joseph Jackson en\n",
            "M.J. en\n",
            "M. J. en\n",
            "King of Pop en\n",
            "King of Music en\n",
            "Król Popu pl\n",
            "Michael Joseph Jackson pl\n",
            "Джексон, Майкл ru\n",
            "MJ ru\n",
            "The King of Pop ru\n",
            "Майкл Джозеф Джексон ru\n",
            "Король поп-музыки ru\n",
            "Майкл Джо Джексон ru\n",
            "Michael Joseph Jackson nl\n",
            "The King of Pop nl\n",
            "迈克尔杰克逊 zh\n",
            "麥可·傑克森 zh\n",
            "米高·積遜 zh\n",
            "米高積遜 zh\n",
            "杰克逊，M. zh\n",
            "MJ gl\n",
            "King Of Pop gl\n",
            "The King gl\n",
            "Michael Joseph Jackson gl\n",
            "MJ es\n",
            "Michael Joe Jackson es\n",
            "Michael Joseph Jackson es\n",
            "Rey del Pop es\n",
            "Rey de la Música es\n",
            "El Rey es\n",
            "El rey del pop es\n",
            "米高·積遜 zh-hk\n",
            "邁克爾傑克遜 zh-hant\n",
            "Regele muzicii pop ro\n",
            "Regele pop-ului ro\n",
            "Michael Joseph Jackson ro\n",
            "A pop királya hu\n",
            "Jacko hu\n",
            "Michael Joseph Jackson hu\n",
            "MJ hu\n",
            "Michael Joseph Jackson ca\n",
            "MJ ca\n",
            "King Of Pop ca\n",
            "King of Music ca\n",
            "The King ca\n",
            "The King of Pop lb\n",
            "Michael Joseph Jackson lb\n",
            "MJ lb\n",
            "പോപ് രാജാവ് ml\n",
            "കിംങ്ങ് ഓഫ് പോപ് ml\n",
            "എം.ജെ ml\n",
            "മൈക്കൽ ജോ ജാക്സൺ ml\n",
            "Miĥaelo Jozefo Jackson eo\n",
            "Roi de la Pop fr\n",
            "Michael Joseph Jackson fr\n",
            "MJ fr\n",
            "MJJ fr\n",
            "roue pop br\n",
            "Michael Joseph Jackson br\n",
            "MJ ja\n",
            "キング・オブ・ポップ ja\n",
            "The King of Pop frc\n",
            "Michael Joseph Jackson frc\n",
            "MJ tr\n",
            "Michael Joseph Jackson tr\n",
            "Džekson Maikl vep\n",
            "Maikl Džozef Džekson vep\n",
            "Džekson Maikl Džozef vep\n",
            "ملك البوب ar\n",
            "مايكل جوزيف جاكسون ar\n",
            "Ем-Џеј sr\n",
            "MJ sr\n",
            "Краљ попа sr\n",
            "Мајкл Џо Џексон sr\n",
            "Мајкл Џозеф Џексон sr\n",
            "Michael Joseph Jackson nb\n",
            "Michael Joe Jackson nb\n",
            "00002961801 IPI nb\n",
            "Michael Joseph Jackson nn\n",
            "MJ ms\n",
            "Raja Pop ms\n",
            "Michael Joe Jackson ms\n",
            "Michael Joseph Jackson ms\n",
            "ማይክል ጆሴፍ ጃክሰን am\n",
            "Michaël Iosephus Jackson la\n",
            "Michaël Jackson la\n",
            "Michael Iosephus Jackson la\n",
            "مايكول جېكسون ug\n",
            "Michael Joseph Jackson se\n",
            "Michael Joe Jackson se\n",
            "Michael Joseph Jackson et\n",
            "Michael Joe Jackson et\n",
            "Michael Joseph Jackson fi\n",
            "Michael Joseph Jackson fit\n",
            "Michael Joe Jackson fit\n",
            "Майкл Джозеф Джексон mhr\n",
            "Майкл Джексон mhr\n",
            "Майкл Джо Джексон mhr\n",
            "Michael Joseph Jackson rmf\n",
            "Michael Joe Jackson rmf\n",
            "Майкл Джозеф Джексон sjd\n",
            "Майкл Джо Джексон sjd\n",
            "Michael Joseph Jackson sje\n",
            "Michael Joe Jackson sje\n",
            "Michael Joseph Jackson sju\n",
            "Michael Joe Jackson sju\n",
            "Michael Joseph Jackson sma\n",
            "Michael Joe Jackson sma\n",
            "Michael Joseph Jackson smj\n",
            "Michael Joe Jackson smj\n",
            "Michael Joseph Jackson smn\n",
            "Michael Joe Jackson smn\n",
            "Michael Joseph Jackson sms\n",
            "Michael Joe Jackson sms\n",
            "Michael Joseph Jackson sv\n",
            "Michael Joe Jackson sv\n",
            "ام‌جی fa\n",
            "سلطان پاپ fa\n",
            "پادشاه پاپ fa\n",
            "ام.جی. fa\n",
            "مایکل جوزف جکسون fa\n",
            "Michael Joseph Jackson co\n",
            "MJJ co\n",
            "ᎹᏱᎩᎵ ᏦᏎᏫ ᏤᎩᏌᏂ chr\n",
            "King of Pop gcr\n",
            "MJ gcr\n",
            "Michael Joseph Jackson gcr\n",
            "The King of Pop gcr\n",
            "The King gcr\n",
            "M.J. gcr\n",
            "Michael Jackson ab\n",
            "MJ ab\n",
            "Michael Joseph Jackson ab\n",
            "M.J. ab\n",
            "King of Pop ab\n",
            "The King of Pop ab\n",
            "King of Pop ban\n",
            "The King of Pop ban\n",
            "Michael Joseph Jackson ban\n",
            "MJ ban\n",
            "M.J. ban\n",
            "Michael Joe Jackson pt\n",
            "Michael Joseph Jackson pt\n",
            "MJ pt\n",
            "Rei do Pop pt\n",
            "MJ da\n",
            "M.J. da\n",
            "M. J. da\n",
            "Michael Joseph Jackson da\n",
            "Michael Joe Jackson da\n",
            "The King of Pop da\n",
            "King of Pop da\n",
            "King of Pop ss\n",
            "The King of Pop ss\n",
            "Michael Jackson az\n",
            "Michael Jackson crh\n",
            "Maykl Cozef Cekson crh\n",
            "Maikel Jakthon din\n",
            "Michael Jackson jbo\n",
            "ಮೈಕಲ್ ಜ್ಯಾಕ್ಸನ್ kn\n",
            "Maikls Džeksons ltg\n",
            "Michael Jackson lv\n",
            "မိုက်ကယ် ဂျက်ဆင် my\n",
            "Michael Jackson om\n",
            "Maekl Jeksun pih\n",
            "Майкл Джексон udm\n",
            "迈克尔·杰克逊 wuu\n",
            "UMichael Jackson xh\n",
            "Michael Jackson xh\n",
            "Michael Jackson sgs\n",
            "Michael Jackson vro\n",
            "Michael Joe Jackson ast\n",
            "Michael Jackson iu\n",
            "Мајкл Џозеф Џексон sr-ec\n",
            "MJ ig\n",
            "The King of Pop ig\n",
            "The King ig\n",
            "King of Pop ig\n",
            "King of Music ig\n",
            "Michael Joseph Jackson ig\n",
            "Eze Pop ig\n",
            "Rei do Pop pt-br\n",
            "Michael Joe Jackson pt-br\n",
            "Michael Joseph Jackson pt-br\n",
            "MJ pt-br\n",
            "Michael Joe Jackson bar\n",
            "Michael Joseph Jackson fy\n",
            "Michael Joe Jackson ku\n",
            "Michael Joseph Jackson sk\n",
            "Michael Joseph Jackson vi\n",
            "Michael Joseph Jackson bs\n",
            "Michael Joseph Jackson fo\n",
            "Michael Joe Jackson jv\n",
            "Michael Joseph Jackson nds\n",
            "Michael Joseph Jackson cs\n",
            "Michael Joseph Jackson id\n",
            "MJ id\n",
            "The King of Pop id\n",
            "Michael Joe Jackson id\n",
            "M.J. id\n",
            "M. J. id\n",
            "King of Pop id\n",
            "King of Music id\n",
            "The King id\n",
            "The King of Pop avk\n",
            "Michael Joseph Jackson avk\n",
            "King of Pop avk\n",
            "King of Music avk\n",
            "The King avk\n",
            "MJ avk\n",
            "Michael Jackson ady\n",
            "The King of Pop ady\n",
            "MJ ady\n",
            "The King ady\n",
            "King of Pop ady\n",
            "King of Music ady\n",
            "Michael Jackson arc\n",
            "The King of Pop arc\n",
            "MJ arc\n",
            "Michael Jackson av\n",
            "The King of Pop av\n",
            "MJ av\n",
            "Джексон, Майкл av\n",
            "Michael Joseph Jackson af\n",
            "Michael Joseph Jackson yo\n",
            "MJ yo\n",
            "The King of Pop yo\n",
            "The King yo\n",
            "The King of Music yo\n",
            "King of Pop yo\n",
            "Ọba Pop yo\n",
            "The King of Pop bm\n",
            "Michael Joseph Jackson bm\n",
            "MJ bm\n",
            "The King bm\n",
            "King of Pop bm\n",
            "King of Music bm\n",
            "M.J. bm\n",
            "𐌼𐌹𐌺𐌰𐌴𐌻 𐌹𐌰𐌿𐍃𐌰𐌹𐍆 𐌳𐌹𐌰𐌹𐌺𐍃𐌰𐌿𐌽 got\n",
            "Michael Jackson uk\n",
            "Король поп-музики uk\n",
            "Michael Joseph Jackson en-us\n",
            "The King of Pop gur\n",
            "MJ gur\n",
            "King of Music gur\n",
            "Michael Joseph Jackson gur\n",
            "Michael Joseph Jackson sco\n",
            "Michael Joe Jackson sco\n",
            "Keeng o Pop sco\n",
            "Майкл Жозеф Жексон lez\n",
            "Майкл Жозеф Жэксон mn\n",
            "Michael Joseph Jackson dsb\n"
          ]
        }
      ]
    },
    {
      "cell_type": "code",
      "source": [
        "qres = g.query('''\n",
        "    SELECT DISTINCT ?label\n",
        "    WHERE {\n",
        "        wd:Q2831 rdfs:label | skos:prefLabel | skos:altLabel ?label .\n",
        "        FILTER (lang(?label) = 'en')\n",
        "    }\n",
        "    ORDER BY ?label\n",
        " ''')\n",
        "for lab, *_ in qres:\n",
        "  print(lab)"
      ],
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "a-V_8LIT5dUk",
        "outputId": "830edf5f-4e79-43d4-e127-647293534fdc"
      },
      "execution_count": 17,
      "outputs": [
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "King of Music\n",
            "King of Pop\n",
            "M. J.\n",
            "M.J.\n",
            "MJ\n",
            "Michael Jackson\n",
            "Michael Joe Jackson\n",
            "Michael Joseph Jackson\n",
            "The King of Pop\n"
          ]
        }
      ]
    },
    {
      "cell_type": "code",
      "source": [
        "qres = g.query('''\n",
        "    SELECT ?label ?description\n",
        "    WHERE {\n",
        "      wd:Q2831 wdt:P166 ?award .\n",
        "      ?award rdfs:label ?label\n",
        "      FILTER (lang(?label)= 'en')\n",
        "      OPTIONAL {\n",
        "        ?award schema:description ?description\n",
        "        FILTER (lang(?description) = 'en')\n",
        "      }\n",
        "    }\n",
        "''')\n",
        "for lab, descrip in qres:\n",
        "  print(f'Award: {lab:<55} Description:{descrip}')"
      ],
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "XGEuzhxS5dRc",
        "outputId": "ef49963b-eb8a-43f9-c92c-3e075175eed4"
      },
      "execution_count": 20,
      "outputs": [
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "Award: Grammy Lifetime Achievement Award                       Description:None\n",
            "Award: Grammy Legend Award                                     Description:None\n",
            "Award: International Artist Award of Excellence                Description:None\n",
            "Award: Genesis Award                                           Description:None\n",
            "Award: Grammy Award for Best Male R&B Vocal Performance        Description:None\n",
            "Award: Grammy Award for Album of the Year                      Description:None\n",
            "Award: Grammy Award for Best Male Pop Vocal Performance        Description:None\n",
            "Award: Grammy Award for Record of the Year                     Description:None\n",
            "Award: Grammy Award for Best Male Rock Vocal Performance       Description:None\n",
            "Award: Grammy Award for Best Album for Children                Description:None\n",
            "Award: Grammy Award for Producer of the Year, Non-Classical    Description:None\n",
            "Award: Grammy Award for Best Music Film                        Description:None\n",
            "Award: Grammy Award for Song of the Year                       Description:None\n",
            "Award: Grammy Award for Best Music Video                       Description:None\n",
            "Award: Johnny Mercer Award                                     Description:None\n",
            "Award: Grammy Award for Best R&B Song                          Description:None\n",
            "Award: Officer of the National Order of Merit                  Description:None\n",
            "Award: Medal of the City of Paris                              Description:None\n",
            "Award: star on Hollywood Walk of Fame                          Description:None\n",
            "Award: American Choreography Awards                            Description:None\n"
          ]
        }
      ]
    },
    {
      "cell_type": "markdown",
      "source": [
        "Speed of the approaches"
      ],
      "metadata": {
        "id": "ZQKgkWomO4Na"
      }
    },
    {
      "cell_type": "code",
      "source": [
        "%timeit -n 1000 list(g.objects(mJ,RDFS.label))"
      ],
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "XIqf7KkE5dOa",
        "outputId": "efc13296-c819-4a2c-87a5-4a72b1f1f2f8"
      },
      "execution_count": 22,
      "outputs": [
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "882 µs ± 8.93 µs per loop (mean ± std. dev. of 7 runs, 1000 loops each)\n"
          ]
        }
      ]
    },
    {
      "cell_type": "code",
      "source": [
        "%timeit -n 1000 g.query('SELECT ?label WHERE {wd:Q2831 rdfs:label ?label}')"
      ],
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "sJQQCR5L5dLT",
        "outputId": "6cebdf9e-ac8c-4ef8-8104-18e99bbafc6b"
      },
      "execution_count": 23,
      "outputs": [
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "3.93 ms ± 565 µs per loop (mean ± std. dev. of 7 runs, 1000 loops each)\n"
          ]
        }
      ]
    }
  ]
}